<?php
//  這個YEE 類別專門放全域都能用的靜態函式，偷學YII 框架的 Yii 類別
//  系統用的 關於SERVER 的變數之類的封裝可能會丟這

// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------- 
class YEE {

    // 獲得 處理過的 $_SERVER['PATH_INFO'] ， [陣列]格式
    // ALL::GetPath()
    public static function GetPath(){
        $url = isset($_SERVER['PATH_INFO']) ? explode('/', ltrim($_SERVER['PATH_INFO'],'/')) : '/';
        return $url;
    }
}

// -----------------------------------------------------------------------------------------------------------------------------------------------------------------------

